{"events":[{"title":"Registration","description":"","start":"2015-09-26T08:00:00","end":"2015-09-26T09:00:00","rooms":["Room 2205A","Room 2205B","Room 2207","Room 2203","Room 2209"],"presenter":null,"id":1},{"title":"Registration","description":"","start":"2015-09-27T08:00:00","end":"2015-09-27T09:00:00","rooms":["Room 2205A","Room 2205B","Room 2207","Room 2203","Room 2209"],"presenter":null,"id":2},{"title":"Adobe Systems","description":"","start":"2015-09-26T09:00:01","end":"2015-09-26T09:50:00","rooms":["Room 2205A","Room 2205B","Room 2207","Room 2203","Room 2209"],"presenter":null,"id":3},{"title":"Lunch","description":"","start":"2015-09-26T12:00:00","end":"2015-09-26T13:30:00","rooms":["Room 2205A","Room 2205B","Room 2207","Room 2203","Room 2209"],"presenter":null,"id":4},{"title":"Lunch","description":"","start":"2015-09-27T12:00:00","end":"2015-09-27T13:30:00","rooms":["Room 2205A","Room 2205B","Room 2207","Room 2203","Room 2209"],"presenter":null,"id":5},{"title":"How Emerging Technologies Are Shaping The Future Of Investing - Fidelity Labs","description":"","start":"2015-09-26T13:30:01","end":"2015-09-26T14:20:00","rooms":["Room 2205A","Room 2205B","Room 2207","Room 2203","Room 2209"],"presenter":null,"id":6},{"title":"Afternoon Break","description":"","start":"2015-09-26T15:30:00","end":"2015-09-26T15:45:00","rooms":["Room 2205A","Room 2205B","Room 2207","Room 2203","Room 2209"],"presenter":null,"id":7},{"title":"After-party / Networking","description":"","start":"2015-09-26T17:45:00","end":"2015-09-26T20:30:00","rooms":["Room 2205A","Room 2205B","Room 2207","Room 2203","Room 2209"],"presenter":null,"id":8},{"title":"THE END / FINAL GIVEAWAYS / CLOSING REMARKS","description":"","start":"2015-09-27T15:30:00","end":"2015-09-27T16:00:00","rooms":["Room 2205A","Room 2205B","Room 2207","Room 2203","Room 2209"],"presenter":null,"id":9},{"title":"Don't Get Bootstrapped Down: Reading the Fine Print on Responsive Frameworks","description":"Responsive web design has revolutionized the way we build websites, and many coders and companies are using prebuilt frameworks like Bootstrap and Foundation to dip their toes into these uncharted development waters. But at what cost? We’ll take a look at the responsive challenges CSS frameworks attempt to solve, as well as some of the potential pitfalls that can come from using out-of-the-box solutions.","start":"2015-09-26T10:00:00","end":"2015-09-26T10:50:00","rooms":["Room 2205A"],"presenter":{"first":"Aaron","last":"Ladage","bio":" Aaron Ladage is a UI engineer for DEG in Overland Park, Kansas. He’s currently obsessed with creating faster, leaner responsive sites, and architecting front-end workflow tools and processes that help other developers do the same. Outside of work and freelance, Aaron is a cliché Kansas City BBQ snob and brews some really bad beer. He's the creator of inputtypes.com, a testing utility for onscreen keyboards, input types and validation patterns, and Yeo+Lab, a front-end website scaffolding tool, with his DEG teammates.","avatar":"images/presenters/ladage_aaron.jpg"},"id":10},{"title":"Form Inputs: The Browser Support Problem You Didn't Know You Had","description":"The lowly form input: it's been a part of the HTML spec for years, but before HTML5, most developers rarely gave it a second thought. As the use of smartphones (and their onscreen keyboards) has flourished, however, the input type has taken on a new and incredibly important role in how people interact with the web … and it's chock-full of browser and device inconsistencies and pitfalls. Learn how input types and patterns can give your users a better onscreen keyboard experience, and how to abuse these features to meet the needs of today (if you must).","start":"2015-09-27T09:00:01","end":"2015-09-27T09:50:00","rooms":["Room 2205A"],"presenter":{"first":"Aaron","last":"Ladage","bio":" Aaron Ladage is a UI engineer for DEG in Overland Park, Kansas. He’s currently obsessed with creating faster, leaner responsive sites, and architecting front-end workflow tools and processes that help other developers do the same. Outside of work and freelance, Aaron is a cliché Kansas City BBQ snob and brews some really bad beer. He's the creator of inputtypes.com, a testing utility for onscreen keyboards, input types and validation patterns, and Yeo+Lab, a front-end website scaffolding tool, with his DEG teammates.","avatar":"images/presenters/ladage_aaron.jpg"},"id":11},{"title":"Getting to know Your (Dev)Toolsbelt","description":"This session will spend some hands on time going over different features of the developer tools built into your browser. This session will assume a basic understanding of developer tools already, and will go over powerful ways to use the devtools, useful shortcuts and features, and maybe a few things that are just for fun.\n\nThe focus will be on the Chrome DevTools, but I may talk about some features of Firefox or even Microsoft Edge.","start":"2015-09-27T10:00:00","end":"2015-09-27T10:50:00","rooms":["Room 2203"],"presenter":{"first":"Jared","last":"Siirila","bio":" As a Software Engineer at IBM and Lenovo, Jared has helped design and develop multiple large scale projects. Lately he has worked on hybrid mobile applications and front end web development building applications and UI frameworks.","avatar":"images/presenters/siirila_jared.jpg"},"id":12},{"title":"HTML5 201","description":"By now we're all familiar with the basics of HTML5 -- new tags for sections of a web page, new form elements, and so on. Now that the spec is finalized, let's take a look at some of the other new features HTML5 has made available to us. In this talk we'll go over things like File IO, audio, video, and SVG support, and show you various new features that are already baked into current web browsers. We'll also show some code samples on how to use them in a modern web application.\n\nTarget Audience: Front-end developers who are familar with the \"basics\" of HTML5 and would like to see what other features HTML5 are mature enough to start using in web applications. Attendees should have prior experience with HTML, CSS, and some JavaScript.\n\nAssumed Knowledge: This talk assumes the audience is very comfortable with modern HTML and basic JavaScript concepts such as variables, functions, and callbacks (though we will briefly explain callbacks as part of the discussion).\n\nMain points:\n\n    Audio and Video support in HTML5\n    Basic and intermediate uses of SVG\n    File IO\n    Data Sets\n    Custom Elements\n    Other miscellaneous features in HTML5","start":"2015-09-26T15:45:01","end":"2015-09-26T16:45:00","rooms":["Room 2205A"],"presenter":{"first":"Nolan","last":"Erck","bio":" Nolan Erck is an independent consultant and instructor, providing tailored services for countries across the US and Europe.  Starting in the video game industry, then advancing to web/mobile development, Nolan has worked on high profile projects for LucasArts, Maxis, Lisa \"Left Eye\" Lopes, Schools Credit Union and others.  He currently co-manages the SacInteractive User Group and can often be found working on a variety of music projects in his spare time.","avatar":"images/presenters/erck_nolan.jpg"},"id":13},{"title":"It's not called Continuous Integration for Nothing!","description":"This talk will dig deep into the process of continuous integration (CI) and the key processes that make up the overall CI process.  We will discuss the relationships and process flows between change management, configuration management, and release/build management and how the CI process, when coupled with a solid performance engineering discipline across the product lifecycle, can result in a better user experience for your web & mobile application.  We will speak about the entire lifecycle, the \"conveyor belt\" of the application lifecycle, with concentration on the \"Big 3\" processes that support the overall CI strategy.\n\nWe will include a real-world example of how SOASTA uses Jenkins and other open source solutions for its \"conveyor belt\" and how this process enables SOASTA to complete over 100 product releases in 2014 and still maintain its customer SLA's for its Saas product offerings.","start":"2015-09-27T11:00:00","end":"2015-09-27T11:50:00","rooms":["Room 2203"],"presenter":{"first":"Dan","last":"Boutin","bio":" Based in Gainesville, Florida, Mr. Daniel Boutin is Senior Product Evangelist at SOASTA.  Prior to that, Mr. Boutin has held roles at IBM Rational and Mercury/HP Software, and has worked for IBM Global Services, specializing in the areas of performance management, testing and scalability and ITIL.  In addition, Mr. Boutin led the corporate SEI initiative at Lockheed Martin and was one of the contributors to ISO 12207, the U.S. commercial software standard.  Mr. Boutin has previously presented his work at the Big Data TechCon in Boston, STAREast, Atlantic Test Workshop (ATW) in Corsica, France, and Durham, New Hampshire.  Mr.Boutin also has presented at the Advanced Technology Workshop in Toulouse, France, and at Hanscom Air Force Base in Massachusetts.  Mr. Boutin has also presented at itSMF events in Milwaukee, Toronto, Atlanta and Calgary, as well as the itSMF National Conference, multiple Gartner Conferences, and many local and regional events on a variety of topics in performance engineering and the SDLC.\n\nYou can find him at dboutin@soasta.com, @DanBoutinSOASTA or at a conference or meet-up near you.","avatar":"images/presenters/boutin_dan.jpg"},"id":14},{"title":"Real World Performance Budgets","description":"The speed of the websites we design has a huge impact on not only user experience, but on conversions and revenue. Having performance discussions throughout the project lifecycle is one of the best ways to ensure a fast website. And one of the best tools to aid in these discussions is a performance budget. Setting one might seem straight forward, but how do they hold up on real world projects that run up against various stakeholders, teams of developers, CMS’s that allow components to be dropped anywhere, and beta and production environments with varying speeds? In this talk, we’ll discuss how to set performance budgets that deliver great experiences in real world environments. We'll cover getting buy-in on the concept, how to set budgets on a per feature basis, and setting up reporting for continuous testing to help maintain the defined budget from the first day of the project to launch.","start":"2015-09-26T15:45:01","end":"2015-09-26T16:45:00","rooms":["Room 2203"],"presenter":{"first":"Brian","last":"Graves","bio":" A UI designer and developer who's passionate about design and the process behind it, Brian is a strong proponent of iterative work, collaborative efforts, and user first design. He is currently the UI team lead at DEG where he does cross-channel design and development work for a range of major brands. He is the creator of Responsive Email Patterns, an organizer of the CodePen Kansas City meetup, and speaks and writes regularly on design and front-end development.","avatar":"images/presenters/graves_brian.jpg"},"id":15},{"title":"Responsive Design: Planning, Execution & Management with Bootstrap 3","description":"Ever find yourself thinking “I need a Responsive Design ramp-up!” or “What’s up with all this Bootstrap 3 chatter?”\n\nIn only the past few years, Responsive Design has completely transformed the UI production landscape.  Mobile market demand has made the move to Responsive a necessity. While going Responsive presents incredible opportunity, it also introduces formidable challenges.  This new UI paradigm challenges conventional methods of planning, production, and project management.  It demands change to keep us efficient and competitive. \n\nSo why use Bootstrap? It’s easy to learn, easy to use, and comes loaded with ready-to-use UI components.  It’s very powerful, extremely customizable, and doesn’t incur a lot of architectural commitment.\n\nThis session serves two purposes.  You will be introduced to building Bootstrap sites, learning to create and configure robust Responsive grid-layouts to match your browser and device requirements.  We’ll also use Bootstrap components that integrate seamlessly into your grid layout.\n\nAdditionally, we’ll discuss the challenges that come with Responsive Design and how to mitigate them.  Topics will include mobile-first content, progressive enhancement, performance optimization, Agile workflows, and complementary tooling.","start":"2015-09-27T13:30:01","end":"2015-09-27T14:30:00","rooms":["Room 2203"],"presenter":{"first":"Eric","last":"Carlisle","bio":" As a UI Developer and UX Designer, Eric Carlisle's passion is for building the user-facing web and the experiences that make it engaging, compelling, and useful. His core approach is to Keep It Stunningly Simple, a practice encouraging creativity and innovation while maintaining pragmatic focus. Via this careful balance, outstanding solutions can be created while maintaining the highest probability of project success.\n\nEric has over 19 years experience, working in almost every aspect of web production. Much of his career has been focused on consulting, working in such market verticals as ecommerce, cybersecurity, automotive, sports entertainment, healthcare, and nonprofit.","avatar":"images/presenters/carlisle_eric.jpg"},"id":16},{"title":"Ridiculously Easy Layouts with Flexbox","description":"Ready to have your mind blown?  Meet Flexbox! The Flexbox (or Flexible Box) Layout Model is a set of CSS attributes that will likely change the way you think about UI layouts.  Flexbox uses a dual-axis, container/item layout model allowing for powerful approaches to element space distribution, alignment, and sizing. This can be a tremendous boon for web projects with dynamic data and design flux. It may also tremendously simplify responsive layouts that are dependent on commonly complicated grid models.\n\nThis presentation will introduce the mechanics of the Flexible Box Model and demonstrate its capability for simplifying markup and styling. Comparisons will be made to other layout paradigms to illustrate strengths of the model.","start":"2015-09-27T14:30:01","end":"2015-09-27T15:30:00","rooms":["Room 2205A"],"presenter":{"first":"Eric","last":"Carlisle","bio":" As a UI Developer and UX Designer, Eric Carlisle's passion is for building the user-facing web and the experiences that make it engaging, compelling, and useful. His core approach is to Keep It Stunningly Simple, a practice encouraging creativity and innovation while maintaining pragmatic focus. Via this careful balance, outstanding solutions can be created while maintaining the highest probability of project success.\n\nEric has over 19 years experience, working in almost every aspect of web production. Much of his career has been focused on consulting, working in such market verticals as ecommerce, cybersecurity, automotive, sports entertainment, healthcare, and nonprofit.","avatar":"images/presenters/carlisle_eric.jpg"},"id":17},{"title":"SASSinate Your CSS Development","description":"Writing CSS is a tedious, manual process. But with the power of SASS, it's not! Learn more about this preprocessor, and how it can help both the coder and designer be far more efficient at writing, communicating, and handling styles. We will cover some of the basics, such as nesting selectors, variables, the power of the `&`, how to apply it to your workflow, and then blow your mind with some powerful functions and mixins.","start":"2015-09-26T16:45:00","end":"2015-09-26T17:35:00","rooms":["Room 2203"],"presenter":{"first":"Tyler","last":"Benton","bio":" Tyler is a Developer & Lead UI/UX Designer at marketamerica.com, motivescosmetics.com, shop.com.  He has 4 years of web development experience, including HTML, CSS, SASS, LESS, Vanilla JS, jQuery, jQuery Mobile, NODE, SHELL, ColdFusion.  His primary focus is to create a unified UI/UX between desktop, mobile, apps, and product branding.  His secondary passion is finding ways to make development more efficient, and he has transformed the way our teams develop to be far more efficient.  When he's not coding, Tyler enjoys playing softball, golf, and other sportsball activities, woodworking, and coding more, just for fun.","avatar":"images/presenters/benton_tyler.jpg"},"id":18},{"title":"The Polymer Revolution","description":"An in depth seminar discussing Google's new Polymer elements, web components and service workers and how they will revolutionize both desktop and mobile web applications. Topics include: semantic tags, custom, portable and configurable widgets in a single html tag, strategic cacheing and offline browsing.","start":"2015-09-27T10:00:00","end":"2015-09-27T10:50:00","rooms":["Room 2205B"],"presenter":{"first":"John","last":"Foushee","bio":" Platform team lead at Stanley Gibbons and VP of Technology for local startup Droparoo. I have worked with technology in the Triangle for 9 years. John seeks out the innovative new technologies in mobile software development.","avatar":"images/presenters/foushee_john.jpg"},"id":19},{"title":"Using Tomorrow's CSS Today","description":"CSS4 may only be in the working draft stage, but that doesn't mean we can't begin to use some of it's capabilities in our current designs. Variables, color manipulation, custom media queries, and custom selectors are just a few of the powerful new features that can be utilized to take our css to the next level. This talk will take a look at the benefits of using postprocessers to write powerful, bleeding-edge CSS and have it work in today's browsers.","start":"2015-09-27T10:00:00","end":"2015-09-27T10:50:00","rooms":["Room 2205A"],"presenter":{"first":"Brian","last":"Graves","bio":" A UI designer and developer who's passionate about design and the process behind it, Brian is a strong proponent of iterative work, collaborative efforts, and user first design. He is currently the UI team lead at DEG where he does cross-channel design and development work for a range of major brands. He is the creator of Responsive Email Patterns, an organizer of the CodePen Kansas City meetup, and speaks and writes regularly on design and front-end development.","avatar":"images/presenters/graves_brian.jpg"},"id":20},{"title":"Web Analytics, Who Cares? I Do, and So Should You!","description":"If hearing about KPIs and monthly reports makes you want to run out of the room, don’t worry! Web analytics doesn’t have to be boring! Even if it’s not your responsibility to care about web analytics, learning more about it could make your job easier. Learn how having accurate, robust web analytics in place can help you make, or at least advocate for, decisions based on data. \n\nWe’ll look at how to use web metrics to identify possible compatibility or performance issues, how a little extra code can give big insights into how users are navigating your site, how web analytics and tracking solutions generally work, common issues to look out for if you’re the one who handles implementing tracking or tags on your projects, and the pros and cons of tag management systems.","start":"2015-09-26T14:30:00","end":"2015-09-26T15:20:00","rooms":["Room 2203"],"presenter":{"first":"Jan","last":"Kleinert","bio":" Jan Kleinert has been excited about web analytics ever since she installed the first hit counter on her Smashing Pumpkins fan site in 1995. Prior to focusing on web analytics, she was part of the Developer Relations team at Google and also held developer support and software engineering roles in the financial services and computer networking industry. She has spoken at various user groups, as well as conferences like JSConf.eu and HTML5 Live. Jan is currently a web analytics program manager at SAS.","avatar":"images/presenters/kleinert_jan.jpg"},"id":21},{"title":"What We Know About Website Users","description":"Don’t guess how people use your website! Based on publicly available UX research and my own research experience, we’ll discuss what we know about users—both big-picture principles and nitty-gritty details. In this session, we will:\n\n• uncover common UX mistakes made by website owners and manager\n• understand how visitors engage with text, photography, and graphics on websites\n• learn important considerations for viewers on mobile devices\n\nUX research offers us important information that can’t be ignored. You’ll walk out of this session with practical tips to better your website immediately. Resources for further UX learning will be provided.","start":"2015-09-26T16:45:00","end":"2015-09-26T17:35:00","rooms":["Room 2205A"],"presenter":{"first":"Melissa","last":"Eggleston","bio":" As a UX researcher and content strategist, Melissa Eggleston helps people and organizations create memorable website content. In 1996 she wrote her first online stories about soccer and violated all best practices we now know about writing online. Previously Melissa worked for Duke University and Bloomberg News. She now acts as a consultant on digital projects for business and non-profits throughout the U.S. Melissa gained her multimedia skills and love of UX at the UNC-Chapel Hill School of Journalism where she got her Master’s degree.","avatar":"images/presenters/eggleston_melissa.jpg"},"id":22},{"title":"Working with Static Sites","description":"For years now we've had powerful application servers like PHP, Node,\nand ColdFusion, that could create our web apps. But there has been a\nshift recently in terms of how much we do on an application server\nversus how much we can do on the browser itself, as well as how much\nis done on a mobile app instead. Static site generators provide a\npowerful middle ground between a full app server deployment and a\nsimple collection of static files. In this presentation I'll talk\nabout why you would use static site generators, how they work in\ngeneral, how one (Harp) works in particular, and discuss how to add\ndynamic aspects back into the static site.","start":"2015-09-27T13:30:01","end":"2015-09-27T14:30:00","rooms":["Room 2205A"],"presenter":{"first":"Raymond","last":"Camden","bio":" I build lots of silly demos involving cats. I work for IBM. IBM has lots of cats.","avatar":"images/presenters/camden_raymond.jpg"},"id":23},{"title":"Advanced JavaScript Debug","description":"If you still write alert to debug JavaScript, this talk is not for you. And God bless you. If you use api like console.table or console.count or conditional breakpoint in dev tool, we are friend. \n\nWith his friends, Md Khan would talk about how developers could master breakpoints even in callback, live editing, network performance, dealing with cookies, page insights, a lot of tricks and tips.\n\nAfter this talk We will become expert timeline, profile, audit and console and some very useful extensions of dev tool. Besides, we will talk about how evaluate performance related issues and resolve memory leak in your application.","start":"2015-09-27T13:30:01","end":"2015-09-27T14:30:00","rooms":["Room 2205B"],"presenter":{"first":"Md","last":"khan","bio":" Md khan is a curious JavaScript developer, a frequent speaker and a co-organizer of Chicago JavaScript meetup. He publishes his tips and tricks for intermediate JavaScript develoeprs at www.thatjsdude.com and videos in https://www.youtube.com/user/khanLearning","avatar":"images/presenters/khan_md.jpg"},"id":24},{"title":"AngularJS the pending doom of 2, or not","description":"This session is all about what is going on in AngularJS land with the release of 2x.  Learn how it's not that scary and how you can start writing your current AngularJS 1x apps in a way to not \"paint yourself in a corner,\" or too much of a corner.\n\nCovers:\nDevelopment environment\nSyntax changes\nTypeScript basics\nPatterns to use to make the transition smooth, er.. less painful\nReal world examples","start":"2015-09-26T14:30:00","end":"2015-09-26T15:20:00","rooms":["Room 2207"],"presenter":{"first":"Adrian","last":"Pomilio","bio":" Adrian has been developing web based applications since 1998, with a heavy focus on UX and Front-end technologies.  You can also find Adrian using JavaScript and Go to control the world around him as well as applications.  A tech enthusiast to the core he is always trying out something new.","avatar":"images/presenters/pomilio_adrian.jpg"},"id":25},{"title":"Build out of this world apps with METEOR!","description":"Web applications went from being a static site with a single form and perl script to full on AJAX implementations and RIA stacks.\n\nIn this session we shall present the METEOR stack! A suberb way to create super responsive and fast applications that are a delight to use and develop.\n\nUsing one language (to rule them all), JavaScript, for both the front and back end, in this session you will see how you can:\n\nBuild modern web applications that feel like desktop apps not a bunch of lose pages strung together\nMake a great experience for both the browser and mobile\nLearn how Meteor applications are super fast and see live data updates (puppies and unicorns!)\nUse one language both in the back end and the front end\nDeploy your applications to mobile and web instantly (ok, in a few seconds at least!)\nThe audience should have some knowledge in building web dynamic applications, whether it is just one form or a fully dynamic web application.","start":"2015-09-27T11:00:00","end":"2015-09-27T11:50:00","rooms":["Room 2205A"],"presenter":{"first":"Mark","last":"Drew","bio":" Mark has been programming CFML since 1996, and even though he has had forays into Perl, ASP and PHP he is still loving every line of code he has crafted with CFML.\n\nAside from commercial projects, Mark has contributed to a number of Open Source projects such as the CFEclipse Project (developing a CFML IDE), Reactor ORM, ColdSpring, ColdBox and the Model-Glue framework.\n\nBecause of this background, Mark has also become a well known speaker at various conferences on subjects close to his heart such as ORM's, Frameworks, Development Tooling and Development Process.\n\nHe runs CMD a London based consultancy that provides training, development services, architectural consulting and performance tuning.","avatar":"images/presenters/drew_mark.jpg"},"id":26},{"title":"Chatting with JS","description":"In this session, we'll explore chatting with Javascript. Did you know that Javascript can hear what we say and even understand it? We'll dive into a few ways to perform speech recognition in the browser or Node.js. But, what good is it all for if JS can't understand us? For this, Ben will chat a bit about Natural Language Processing (NLP) in Javascript - how we can pick apart sentences into something that can be understood. Lastly, what if JS could talk back to us? We'll also explore text to speech so our conversations don't have to be so one-sided.","start":"2015-09-26T15:45:01","end":"2015-09-26T16:35:00","rooms":["Room 2205B"],"presenter":{"first":"Ben","last":"Farrell","bio":" I like to call myself a Creative Developer. To me, Creative Dev means working on the intersection of web, mobile, applications, and art. It means that I can do full-stack development to get a project done, but also favor the user interface and would prefer that the UI represents the immersive experience and the artistic edges of application development","avatar":"images/presenters/farrell_ben.jpg"},"id":27},{"title":"Debugging Node","description":"Having trouble figuring out where things went wrong in your new Node.js application? Have a slow memory leak dragging down your request times? Not sure where to start looking? Then this session is for you!\n\nWhile Node.js may still be in its adolescence, the tools to properly build, debug, monitor, profile, and scale applications are advancing quickly. This session will introduce developers to proper debugging techniques for Node including understanding the console and other logging mechanisms, using the REPL and debug consoles, node-inspector, and some profiling tools. By the end of the talk developers will be better prepared to tackle those nagging bugs and be confident that their applications are performing well.","start":"2015-09-27T14:30:01","end":"2015-09-27T15:30:00","rooms":["Room 2205B"],"presenter":{"first":"Jordan","last":"Kasper","bio":" Shortly after it arrived at his home in 1993, Jordan began disassembling his first computer - his mother was not happy. She breathed more easily when he moved from hardware into programming, starting with BASIC. Jordan's experience includes companies large and small, universities, and numerous OSS projects. He also participates in local user groups, barcamps, and hackathons. Jordan's mission for the last 10 years has been to evangelize technology of all sorts and share what he has learned. He currently works as a Developer Evangelist for StrongLoop, a leader in Node.js API software.","avatar":"images/presenters/kasper_jordan.jpg"},"id":28},{"title":"Getting started with React JS","description":"React is developed by engineers at facebook to work with large application with data that changes over time. You can create reusable component very easily to update view of your MVC application very efficiently. React only update the part has changed than other popular framework like angular. This talk will also cover hands on example to combine angular with react to make your application faster.","start":"2015-09-26T10:00:00","end":"2015-09-26T10:50:00","rooms":["Room 2205B"],"presenter":{"first":"Md","last":"khan","bio":" Md khan is a curious JavaScript developer, a frequent speaker and a co-organizer of Chicago JavaScript meetup. He publishes his tips and tricks for intermediate JavaScript develoeprs at www.thatjsdude.com and videos in https://www.youtube.com/user/khanLearning","avatar":"images/presenters/khan_md.jpg"},"id":29},{"title":"Going Beyond Hello World: Building Production-Ready AngularJS Applications","description":"Who doesn't love a \"Hello World\" applications? They are great for teaching concepts and getting your feet wet in a programming language. Unfortunately they rarely scale to meet the needs of the \"real\" applications that your business needs. As you build larger and more complex applications, there are different methods and considerations you must master in order to deliver a final product that is both usable and maintainable.\n\nThis session will cover four areas that often prove difficult for developers as they build larger AngularJS applications:\n\n* Using advanced modularization and routing to organize your application code to more easily be able to reuse, maintain and troubleshoot it\n* Creating services and interceptors to centralize data interactions, error handling and more\n* How to wisely use directives and filters to keep your view fragments and controllers clean and understandable\n* Strategies for improving performance of applications before going to production","start":"2015-09-26T14:30:00","end":"2015-09-26T17:35:00","rooms":["Room 2209"],"presenter":{"first":"Sharon","last":"DiOrio","bio":" Sharon: After a long tenure developing web apps with conventional technologies, she is currently building the next generation of educational technologies with Addison Group in Boston. In her spare time, she is the \"Head Instigator” of the AngularJS-Boston Meetup, and enjoys starting religious debates on hot topics like semi-colon usage, IDE choices and 2 vs. 4 space indentations. She has a BFA from SMU and a Masters with honors from RTFM.\n\nDan: Long time server-side developer who transitioned to building client side apps with Javascript over the last couple of years. Total geek who loves exploring shiny new things. Avid shooter, sometime video gamer and budding home automation enthusiast.","avatar":"images/presenters/dan skaggs_sharon diorio.jpg"},"id":30},{"title":"How I stopped worrying and learned to love TypeScript","description":"JavaScript has evolved significantly since the time it was first introduced 20 years ago. Today, JavaScript is the most popular programming language that allows to build large scale applications both on the client and on the server side. However, maintaining large codebases becomes more, and more challenging.\n\nIn this talk I will show how TypeScript helps to build and maintain large scale web applications. I will also present the tools to work with TypeScript, how to take advantage of TypeScript while working with AngularJS 2, and lessons learned during work on the Azure Portal.","start":"2015-09-27T11:00:00","end":"2015-09-27T11:50:00","rooms":["Room 2205B"],"presenter":{"first":"Jakub","last":"Jedryszek","bio":" Jakub Jedryszek works for Microsoft as Software Engineer. Currently he works on the Azure Portal – the largest and most complex Single Page Web Application in the World written in TypeScript. He is a founder of dotNetConfPL – online conference for .NET Developers. His blog is at jj09.net.\n\nBefore Microsoft Jakub developed a Model-Driven Development and Verification Approach for Medical Devices, while working for SAnToS Lab. He was also working as Web Developer in USA and Poland.","avatar":"images/presenters/jedryszek_jakub.jpg"},"id":31},{"title":"Instantly prototype responsive MVC-based web apps","description":"We all know the problem: The manager wants to see a proof-of-concept by tomorrow! What do you do? Develop some spaghetti code and deploy it to a cloud instance? Potentially. But, what if you'd like to re-use your concept but still be quick? There's a solution for that: JavaScript playgrounds combined with greenfield MVC projects help you to achieve exactly that. Jumpstart and focus on reusable code that can be shared easily with others.\n\nIn this session, I’ll show you how to instantly prototype fully responsive web apps that make use of the Model-View-Controller pattern while consuming JSON data. You’ll leave this session with an understand on how to build your first OpenUI5 web app, running on the JavaScript playground Plunker.\n\nWhat is OpenUI5? An open-source web UI library with MVC support, data binding, more than 180 extendable and responsive UI elements, i18n, and much more – in just one library. It uses jQuery as it's foundation and thus allows you to make use of your existing knowledge.\n\nYou can learn more about OpenUI5 at http://openui5.org and get yourself familiar with Plunker (http://plnkr.co) before the workshop.\n\nRequirements: Knowledge about JavaScript (+ jQuery) and HTML","start":"2015-09-26T11:00:00","end":"2015-09-26T11:50:00","rooms":["Room 2205A"],"presenter":{"first":"Alexander","last":"Graebe","bio":" I'm a Developer Advocate at SAP Labs, passionate about Open Source and Web Development. I gave presentations about JavaScript libraries at DeveloperWeek, SAP TechED, and as a guest lecturer at SFSU. Furthermore, I'm the lead organizer of the Bay Area Open Source meetups and evangelize SAP technologies at various events and conferences.","avatar":"images/presenters/graebe_alexander.jpg"},"id":32},{"title":"Javascript Promises - Control your asynchronicity","description":"Still using callbacks to manage your asynchronous workflow in Javascript? As ES6 Harmony nears release, it's time to add Promises to your Javascript toolbox. Promises provide a more manageable layer over your asynchronous workflow, allowing you to avoid those callback-within-a-callback layers known as 'callback hell'.\n\nWe'll use the Bluebird.js library to cover multiple Promise patterns, and cover how to Promisify existing callback-based libraries into Promise-driven luxuries.\n\nReady yourself for the native Promise functions coming soon in Javascript ES6!","start":"2015-09-26T11:00:00","end":"2015-09-26T11:50:00","rooms":["Room 2205B"],"presenter":{"first":"Matthew","last":"Eash","bio":" Matthew Eash is an enterprise architect, lead developer, and data guru. He is currently heading up multiple data and visualization initiatives for a national research lab.","avatar":"images/presenters/eash_matthew.jpg"},"id":33},{"title":"Keep Calm and Trust No One: Protecting data with end-to-end encryption","description":"There have been a large number of high-value data breaches, lately.  It is important to follow best practices, to protect sensitive data.  There are additional steps that you can take, though.  I intend to show you how to read in a file using javascript's FileReader API, asymmetrically encrypt it, and upload the encrypted file to your server. I will then show how to decrypt the file once it reaches the recipient's browser.  The file will not only never be readable on the server but it will only be readable by the intended recipient(s).","start":"2015-09-26T11:00:00","end":"2015-09-26T11:50:00","rooms":["Room 2203"],"presenter":{"first":"Joe","last":"Steinbring","bio":" Joe is a Milwaukee native, with over 8 years of application development experience.  He has used ColdFusion on a daily basis since CF7 and is a regular at MilwaukeeJS meet-ups.","avatar":"images/presenters/steinbring_joe.jpg"},"id":34},{"title":"Lightpainting with Robots! And JavaScript!","description":"About a year ago I bought a uArm desktop robot via Kickstarter. It's tons of fun and I've learned a lot about C and Arduino real-time programming. However, C is a total pain and it'd be much more fun to use JavaScript instead. I'll demonstrate sending the robot commands over serial/Bluetooth from NodeJS.\n\nI combined this with an RGB LED and a second Arduino controller. This LED can be controlled from the same JS program controlling the robot. Add a dark room and long-exposure photography, and it's possible to create amazing in-camera \"paintings\" with pure light (no Photoshop). Presentation will include a few inspirational examples, a dash of code (open-source), and a live demo.","start":"2015-09-27T09:00:01","end":"2015-09-27T09:50:00","rooms":["Room 2207"],"presenter":{"first":"Jon","last":"Williams","bio":" A front-end developer with 18 years experience, Jon ran a poetry slam and connected a robotic ouija board to the Internet pre-2000. After a long and complex relationship with ActionScript, denial gave way to anger, bargaining, depression, and now acceptance of JavaScript. He lives in Raleigh, NC and tweets @shovemedia.","avatar":"images/presenters/williams_jon.jpg"},"id":35},{"title":"Ludology in JavaScript","description":"An introduction to some of the building blocks of video games, using concepts you already know from making web apps to show you how to get started making games in the browser. We'll look at data storage, state management, game loops, procedural generation, and more, with examples using rot.js and Phaser.","start":"2015-09-27T14:30:01","end":"2015-09-27T15:30:00","rooms":["Room 2207"],"presenter":{"first":"Kevin","last":"Zurawel","bio":" I write JavaScript at Braintree. Previously, I've worked freelance and in news media, higher education, and digital marketing. In my free time, I like video games, reading, and travel.","avatar":"images/presenters/zurawel_kevin.jpg"},"id":36},{"title":"Object-Oriented JavaScript (yes, it really exists)","description":"What's that you say? You don't like working in JavaScript because you can't code like you want to with capital \"O\" Objects all over the place? Sure you can. More and more people are starting to realize how powerful this little language can be. Start your re-education with this session and learn all about OOP in JS. First, we have to accept that while JavaScript may exhibit some characteristics of a functional language, it is really a multi-paradigm language with strong support for Object-Oriented Programming concepts.\n\nThis talk will give attendees a crash course in Object-Oriented JavaScript covering:\n\n* core OOP principles\n* the prototype object and constructors\n* member access types (public, private, & privileged)\n* prototypical inheritance\n* interfaces (mixins)\n\nDevelopers will come out of this session ready to implement core OOP concepts in JavaScript, with knowledge of how inheritance in JavaScript differs from many of the other languages they know.","start":"2015-09-26T14:30:00","end":"2015-09-26T15:20:00","rooms":["Room 2205B"],"presenter":{"first":"Jordan","last":"Kasper","bio":" Shortly after it arrived at his home in 1993, Jordan began disassembling his first computer - his mother was not happy. She breathed more easily when he moved from hardware into programming, starting with BASIC. Jordan's experience includes companies large and small, universities, and numerous OSS projects. He also participates in local user groups, barcamps, and hackathons. Jordan's mission for the last 10 years has been to evangelize technology of all sorts and share what he has learned. He currently works as a Developer Evangelist for StrongLoop, a leader in Node.js API software.","avatar":"images/presenters/kasper_jordan.jpg"},"id":37},{"title":"Passing on the right: Fast JavaScript for Slow Browsers","description":"Speed is the main ingredient of any good user interface, and delivering a fast UI can be a challenge on older browsers and mobile devices. This session will discuss why JavaScript is built for speed, how browsers draw things on the screen, and how to make it all as smooth as possible, even when you cant use CSS transitions.","start":"2015-09-26T14:30:00","end":"2015-09-26T15:20:00","rooms":["Room 2205A"],"presenter":{"first":"Elliot","last":"Laster","bio":" Trained as a chef, Elliot Laster has been building UIs in JavaScript for more than ten years. He is currently Technical Architect at Premier Inc, a healthcare performance improvement alliance of approximately 3,400 U.S. hospitals and 110,000 other providers.","avatar":"images/presenters/laster_elliot.jpg"},"id":38},{"title":"The Goldfish Layout: Growing to Fit Its World","description":"Once upon a time, there was only one screen size, the standard. Now, there are many: the Retina on your macbook, the display on your desktop, your smartphone, the TV hooked up to your Wii, even the watch on your wrist. And guess what, there's a lot more coming and probably in places you haven't thought of, like your car. So how do you, as a developer, make sure your web page works on all of them? You could use CSS media queries. But then you might be making breakpoints and layouts for the rest of your life. And have fun maintaining the codebase with all of that in it, it'd be a bloated nightmare. So now what? What if I told you that you can still solve this problem? What if I told you that there's a layout that will figure out how to fit itself on a screen for you? Even on screens that don't exist yet.","start":"2015-09-26T16:45:00","end":"2015-09-26T17:35:00","rooms":["Room 2205B"],"presenter":{"first":"Priscilla","last":"Han","bio":" I am an associate developer at Premier Inc. I am graduate from Georgia Tech. I'm also an artist, of sorts, kinda. I'm also a gamer, very. I'm a writer, in my free time. And I'm a teacher, or I was. I'd like to still think of myself as am, but technically was. I'm a programmer by trade. I'm a designer in training. I'm a student in the world. And I aim to make a difference.","avatar":"images/presenters/han_priscilla.jpg"},"id":39},{"title":"Writing jQuery UI/Mobile Widgets","description":"In this session, we will learn the ins and outs of using the jQuery UI widget factory, including its use with jQuery Mobile. We will cover the differences between widgets and plugins, as well as when it is more appropriate to use a widget vs a plugin. We will also learn the basics of how to create a jQuery UI widget, along with implementing widgets to work with jQuery Mobile. A working knowledge of jQuery is advisable to get the most from this session.","start":"2015-09-27T10:00:00","end":"2015-09-27T10:50:00","rooms":["Room 2207"],"presenter":{"first":"Jessica","last":"Kennedy","bio":" Jessica is a Lead Mobile UI Developer at marketamerica.com/motivescosmetics.com/Shop.com. She has nearly 10 years of web development experience, including HTML, CSS, Javascript, jQuery, jQuery Mobile, ColdFusion, Java, PHP, & SQL. Her current role includes helping drive the mobile & fully-responsive web experience for multiple e-commerce sites. In her spare time she is typically reading Harry Potter with her kids.","avatar":"images/presenters/kennedy_jessica.jpg"},"id":40},{"title":"Crash Course in Ionic + AngularJS","description":"Ionic is a great tool for building hybrid mobile apps and AngularJS is a great JavaScript framework that plays very nicely with Ionic.  In this talk we'll go over the basics of getting started with AngularJS+Ionic.  We'll look at some real code from each of the 2 libraries and see what all is involved in building a hybrid mobile application. We will finish our journey with a real-life Ionic app presentation powered by RESTFul services.\n\nTarget Audience: People that want to see where to start with AngularJS and how it fits into Ionic. This talk assumes no prior knowledge with either library. If you've built a PhoneGap mobile app but felt lost when adding MVC-style structure or Bootstrap-esque UI components, this is the talk for you.\n\nAssumed Knowledge: Attendees should be comfortable with \"modern JavaScript\".  A basic understanding of classes and objects and variable scopes will be helpful.  Some basic prior exposure to PhoneGap/Cordova and a UI-framework such as Bootstrap will also be helpful.\n\nMain points:\n\nA quick overview of MVC.\nBuilding your first AngularJS project\nAdding Routes, Controllers, and Routes to your AngularJS project.\nBuilding your first Ionic mobile app.\nBasic UI components provided by Ionic.\nHow Ionic and AngularJS fit together.","start":"2015-09-27T13:30:01","end":"2015-09-27T14:30:00","rooms":["Room 2207"],"presenter":{"first":"Nolan","last":"Erck","bio":" Nolan Erck is an independent consultant and instructor, providing tailored services for countries across the US and Europe.  Starting in the video game industry, then advancing to web/mobile development, Nolan has worked on high profile projects for LucasArts, Maxis, Lisa \"Left Eye\" Lopes, Schools Credit Union and others.  He currently co-manages the SacInteractive User Group and can often be found working on a variety of music projects in his spare time.","avatar":"images/presenters/erck_nolan.jpg"},"id":41},{"title":"Create Offline Mobile Apps with Couchbase Mobile","description":"What happens when your mobile device does not have a network connection?  That device will have no content, no experience and the amazing application that you spent so much effort to build just simply will not work.  \n\nThis talk would be around the implementation story of creating offline and online applications on Mobile.   \nThe journey begins with NoSQL database modeling and what we can do with a NoSQL technology for mobile.  The session will go through how to create data object model relations, design for performance in difficult areas with no signal, and how to develop a local NoSQL datebase that syncs to the cloud.  \n\nWe will go over code on how to have your mobile application function offline without relying on the network.  You will gain knowledge in NoSQL databases technologies and walk away with insights on how to create offline type of applications that to sync to the cloud.  \n\nCouchbase Mobile is a thin client library that would help developers with their mobile projects in creating a local data layer for offline user experience and will provide fast sync capabilities when there is available network connectivity.","start":"2015-09-27T11:00:00","end":"2015-09-27T11:50:00","rooms":["Room 2207"],"presenter":{"first":"William","last":"Hoang","bio":" William is a Developer Advocate on the Mobile Engineering & Developer Relations team at Couchbase. His love for coffee and code has transcended him into the world of mobile while appreciating the offline in-person experiences. \n\nPrior, William worked on Developer Relations team over at Twitter, BlackBerry, and Microsoft while also having been a Software Embedded GPS engineer at Research In Motion.\n\nWilliam graduated from McGill University in Electrical & Software Engineering.  Some previous tech conferences that William has spoke at were:  GDC, Droidcon NYC, Mobileweek NYC, AnDevCon Boston, PAX Seattle, along with various technology meetups. \n\nTwitter: http://bit.ly/sweetiewill\nLinkedIN: http://bit.ly/myLinkedIN","avatar":"images/presenters/hoang_william.jpg"},"id":42},{"title":"Let's be Social with Ionic","description":"Everyone wants to be social and likes to share, why not create an instant messaging (i.e. Chat) mobile app, I will show you how to take the power of HTML5, CSS and JavaScript and build a solution compose of front-end and back-end. \nIn this talk will show you how to quickly build a mobile App using Ionic and a back-end service using NodeJS, to get people talking and socializing.\nYou will walk out of the talk with the motivation to show off to your friends, family and co-workers that you built a messaging app during the weekend that they can start using it Monday morning since it’s built for Mobile and Cloud.\n\nSome of the open source projects to be discuss are:\n- Using NodeJS* for backend logic\n- Using Ionic Framework an Angular based framework for mobile\n- Apache Cordova (aka PhoneGap)\n\n* I will be using IBM Cloud (Bluemix), but there are other vendors that support this type of stack","start":"2015-09-27T09:00:01","end":"2015-09-27T09:50:00","rooms":["Room 2205B"],"presenter":{"first":"Carlos","last":"Santana","bio":" Carlos works at IBM as a Software Architect on Mobile Developer Tools for IBM MobileFirst and Bluemix. \nHe is also an Apache Cordova committer and involved on leveraging open source technologies within IBM’s MobileFirst organization. \nHe joined IBM 13 years ago after graduating from the University of Puerto Rico RUM in Electrical and Computer Engineering, moved to NC and got a Master of Computer Science @ NCSU.\n\nCarlos likes beer, spending time with his family and troll folks with gifs on different Slack communities such as the cordova.slack.com and ionic-worldwide.slack.com\n\nTwitter http://twitter.com/csantanapr  \nGitHub http://github.com/csantanapr","avatar":"images/presenters/santana_carlos.jpg"},"id":43},{"title":"Mobile First from a Product Manager's Perspective","description":"What does it take to produce a mobile-friendly and stable product that performs as advertised? \n\nIn this session, we're going to enumerate common use cases you may face, coupled with some geeky dives into technology, and sprinkled with many, many, many lessons learned the hard way.\n\nFrom backlog to the app store, we'll enumerate many of the steps in delivering  native, hybrid, and web apps that contains no browser plug-ins, no DOM manipulation, and no chili powder!","start":"2015-09-26T15:45:01","end":"2015-09-26T16:35:00","rooms":["Room 2207"],"presenter":{"first":"Dean","last":"Peters","bio":" Dean Peters is that inventive leader who connects others, make things happen & creates order out of your software development chaos. Currently a product manager for Teradata's line of Marketing Operations offerings, Dean also served as a manager of mobile software development at McClatchy Interactive.","avatar":"images/presenters/peters_dean.jpg"},"id":44},{"title":"Optimizing the performance of mobile web apps","description":"The topic will be useful for everybody who works with JavaScript and HTML on mobile devices (mobile websites, hybrid apps, PhoneGap, native HTML5 (Ubuntu Touch, Tizen, FireFox OS)) The main questions that will be discussed: Mobile Performance File loading (data, js, css) Ender tree optimization (reflow, repaint) DOM optimization (excess DOM, custom events, DOM manipulation) JS Optimization (GC, Object Pools) We will talk about the key moments that should be considered while using JavaScript, HTML and CSS for mobile development; typical mistakes and the most appropriate methods.","start":"2015-09-26T11:00:00","end":"2015-09-26T11:50:00","rooms":["Room 2207"],"presenter":{"first":"Iurii","last":"Luchaninov","bio":" Iurii Luchaninov, Head of HTML5/JS/CSS Department, would like to speak at your event sharing his 10+ years experience with other developers from all over the world. Yurii was in Top 1% Android developers of the world in 2009. He is an active speaker at notable European and American IT conferences (CeBIT, HTML5DevConf, droidcon, Mobile App Europe, iforum, mdday etc.)","avatar":"images/presenters/luchaninov_iurii.jpg"},"id":45},{"title":"ColdFusion: Code Security Best Practices","description":"Oh no, I've been hacked! Have you ever uttered these words? Do you hope to never have to utter these words? If you said yes to either question, then this is one session you don't want to miss!\n\nIn this session we'll cover best practice techniques you can use every day in your ColdFusion application development to bring peace of mind using layered security best practices like obfuscation, encryption, session management and authentication. You will learn:\n\n* What obfuscation is, and when, where and how to use it for layered security.\n\n* What encryption is, and when, where and how to use it for layered security\n\n* How to build your own session management solution that follows layered security best practices.\n\n* How to leverage the browser to provide secure authentication mechanisms, including federated and multi-factor authentication.\n\n* How to think like a hacker, and how to avoid the common pitfalls developers run into when building secure applications.\n\nOur aim in this session is to provide you with the tools and techniques you'll need to write highly secure code, protect your customers identifiable data and ensure a secure solution.","start":"2015-09-26T10:00:00","end":"2015-09-26T10:50:00","rooms":["Room 2203"],"presenter":{"first":"Denard","last":"Springle","bio":" Denard Springle is the CEO of Virtual Solutions Group LLC, a leading innovator in online, in-store and mobile commerce application development. Denard has been programming software for over two decades and brings his knowledge and experience to bear to user groups, conferences and one-on-one mentoring and training sessions.","avatar":"images/presenters/springle_denard.jpg"},"id":46},{"title":"W3C Content Security Policy & HTTP Headers for Security","description":"Would you like a way to improve the security of your web application without having to change any code but just add several HTTP headers. In this session, David takes you through existing HTTP headers that can be used to improve security with modern web browsers. He also goes in depth on W3C Content Security Policy which makes it much more difficult to exploit Cross-Site Scripting (XSS) by explicitly telling the broswer where it can load resources.\n\nMain Points:\n * HTTP Headers for security\n   * X-Frame-Options\n   * X-XSS-Protection\n   * X-Content-Type-Options\n * HTTP Strict Transport Security\n * W3C Content Security Policy\n\nTarget Audience:\n Developers and system/web administrators\n\nAssumed Knowledge:\n Understanding of what an HTTP Header is","start":"2015-09-27T09:00:01","end":"2015-09-27T09:50:00","rooms":["Room 2203"],"presenter":{"first":"David","last":"Epler","bio":" Security Architect with AboutWeb in Rockville, MD. \nSpoke at NCDevCon previously, dev.Objective(), CF Summit, various User groups","avatar":"images/presenters/epler_david.jpg"},"id":47},{"title":"Web Application Security 101","description":"Do you nod in agreement when your coworkers talk about SQL injection or XSS, afraid to admit you don't know what they are talking about? Do security experts make you feel like you can't know learn security if you don't already know security? If so, this session is for you!\n\nI will go over the most common security vulnerabilities in modern web applications, explaining how an attacker might attempt to use them, and how you can protect against them. I'll demonstrate with practical code examples in Javascript, PHP, and ColdFusion.","start":"2015-09-27T14:30:01","end":"2015-09-27T15:30:00","rooms":["Room 2203"],"presenter":{"first":"Kip","last":"Robinson","bio":" Kip is a graduate of NC State's Computer Science program who has been developing software for over a decade. He currently lives in the Triangle area and works from home for Charlotte-based Verian.","avatar":"images/presenters/robinson_kip.jpg"},"id":48},{"title":"Web Penetration & Hacking Tools","description":"Most security presentation to developers are a dry rehashing of OWASP Top Ten; do this and don't do that with terse snippets of code. This session aims to be different in that the tools that are available to hackers will be demonstrated to show how a web application is attacked. Using the OWASP Top Ten as a guide, a combination of vulnerabilities will be used to attack a demonstration application. Two tools that will be highlighted are sqlmap, BeEF (Browser Exploitation Framework), Metasploit, and published exploit scripts.\n\nMain Points:\n * Recent events in security and hacking\n * Overview of OWASP 2013 Top Ten\n * Show how attacks are never a single issue, but combination of vulnerabilities\n * See what SQL Injection and password compromise really look like\n * See why XSS is a serious vulnerability\n * See authentication bypass in action\n * Quick overview of Web Application Firewalls and Web Vulnerability Scanners\n\nTarget audience:\n Developers that want to be more security conscience\n\nAssumed Knowledge:\n Basic knowledge of OWASP Top Ten","start":"2015-09-26T16:45:00","end":"2015-09-26T17:35:00","rooms":["Room 2207"],"presenter":{"first":"David","last":"Epler","bio":" Security Architect with AboutWeb in Rockville, MD. \nSpoke at NCDevCon previously, dev.Objective(), CF Summit, various User groups","avatar":"images/presenters/epler_david.jpg"},"id":49},{"title":"Build your first Couchbase Application","description":"In this practical session we will build a NoSQL Couchbase application from start to finish. The phased approach will be used to build a full-blown e-commerce website. We will begin by installing Couchbase and CommandBox. Then, using code examples as a base, we will work together to complete several hands-on exercises.","start":"2015-09-27T09:00:01","end":"2015-09-27T10:50:00","rooms":["Room 2209"],"presenter":{"first":"Aaron","last":"Benton","bio":" Aaron is an experienced architect who specializes in creative solutions to develop innovative mobile applications. He has over 10 years experience in full stack development, including ColdFusion, SQL, NoSql, JavaScript, HTML & CSS.  Aaron is currently the Mobile Applications Architect for Shop.com in Greensboro, North Carolina.","avatar":"images/presenters/benton_aaron.jpg"},"id":50},{"title":"Getting Started with NoSQL","description":"Learn basics and best practices of NoSQL and data modeling, and how it differs from relational databases.  Participants will also learn ways to determine whether to use NoSQL or a more traditional relational database to suit their needs. We will look at ACID (Atomicity, Consistency, Isolation, Durability) as it relates to relational databases vs NoSQL databases.","start":"2015-09-26T10:00:00","end":"2015-09-26T10:50:00","rooms":["Room 2207"],"presenter":{"first":"Aaron","last":"Benton","bio":" Aaron is an experienced architect who specializes in creative solutions to develop innovative mobile applications. He has over 10 years experience in full stack development, including ColdFusion, SQL, NoSql, JavaScript, HTML & CSS.  Aaron is currently the Mobile Applications Architect for Shop.com in Greensboro, North Carolina.","avatar":"images/presenters/benton_aaron.jpg"},"id":51}]}